/**
 * npm为你和你的团队打开了连接整个JavaScript天才世界的一扇大门。它是世界上
 * 最大的软件注册表,每星期大约有30亿次的下载量,包含60万个包(package).来自
 * 各大洲的开源软件开发者使用npm互相分享和借鉴。包的结构使您能够轻松跟踪依赖
 * 项和版本
 *
 * npm由三个独立的部分组成:
 * 网站:是开发者查找包(package)、设置参数以及管理npm使用体验的主要途径
 * 注册表:是一个巨大的数据库,保存了每个包(package)的信息
 * 命令行工具(CLI):通过命令或终端运行.开发者通过CLI和npm打交道
 *
*/

/**
 * npm能够做的事(部分)
 * 1.将软件包调整到您的应用程序,或按原样合并它们
 * 2.下载可立即使用的独立工具
 * 3.无需使用npx下载即可运行包
 * 4.与任何npm用户共享代码
 * 5.将代码限制为特定开发人员
 * 6.组建虚拟团队
 * 7.管理多个版本的代码和代码依赖项
 * 8.更新基础代码时,轻松更新应用程序
 * 9.发现解决同一难题的多种方法
 * 10.找到其他正在处理类似问题的开发人员
*/

/**
 * 如何查找包
*/